<div style="font-size: 36px;">
COMS W4111 -- Introduction to Databases, Spring 2026<br>Lecture 3 Examples
</div>

# Initialize Environment

In [1]:
%load_ext sql

In [2]:
# %magic

In [3]:
# %pip install pandas
# %pip install pymysql

In [4]:
db_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [5]:
# This is a hack to fix a version problem/incompatibility  with some of the packages and magics.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [6]:
%sql $db_url

In [7]:
import pandas

In [8]:
from sqlalchemy import create_engine

In [9]:
engine = create_engine(db_url)

# Some Examples

In [11]:
%sql select * from db_book.student

 * mysql+pymysql://root:***@localhost
13 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58')),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60')),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98')),
 ('98988', 'Tanaka', 'Biology', Decimal('120'))]